package com.ural_nigmatullin.skssapplication.data;

import com.ural_nigmatullin.skssapplication.domain.ArticleRepositoryInterface;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;

import io.reactivex.Single;

/**
 * Стабовый репозиторий новостей
 * Created by enigm on 31/03/2018.
 */
public abstract class FakeArticleRepository implements ArticleRepositoryInterface {

    private static final String[] NEWS_TITLES = {
            "Победитель Республиканской олимпиады по общеобразовательной дисциплине «История»",
            "Уважаемые работники жилищно-коммунального хозяйства, бытового обслуживания населения и торговли!",
            "Пятый день декады - день русского языка и литературы",
            "Четвертый день декады - день английского языка",
            "Глубочайшие соболезнования родным и близким погибших!"
    };

    private static final String[] NEWS_CONTENTS = {
            "23 марта 2018 г. на базе Уфимского колледжа отраслевых технологий проходила Республиканская олимпиада по общеобразовательной дисциплине «История», среди обучающихся профессиональных образовательных организации Республики Башкортостан.\n" +
                    "\n" +
                    "Студентка второго курса ГБПОУ СКСС Хусаинова Марина заняла I место среди обучающихся по программе подготовки специалистов среднего звена. Руководителем являлась - преподаватель истории Смакова Зимфира Айдаровна.\n" +
                    "\n" +
                    "На торжественной церемонии закрытия, студентке был вручен диплом победителя олимпиады и ценный приз.",

            "В этот день мы отдаем дань публичного уважения и признания людям, обеспечивающим работоспособность важнейших систем жизнеобеспечения.\n" +
                    "\n" +
                    "Работники торговли и  бытового обслуживания вносят большой вклад в развитие экономики нашего города, постоянно расширяют спектр предоставляемых  услуг,  улучшают их качество, создавая хорошее  настроение  и удобства в нашей жизни.",

            "Пятый день декады предметов гуманитарного цикла посвящен двум предметам, которые занимают особое место в нашей жизни  - это   русский язык и русская литература. \n" +
                    "\n" +
                    "В понедельник, 19 марта преподаватели Шаранова Любовь Леонидовна и Янбекова Тагира Хурматовна совместно подготовили и провели День поэзии. Обучающиеся  групп №20  и №22 заранее выучили стихотворения и с выражением их декламировали. Было приятно наблюдать как обучающиеся внимательно слушали своих преподавателей о поэтах, стихи которых они выучили.",

            "17 марта  преподаватели английского языка   провели два интересных мероприятия. Байзигитова Светлана Николаевна   в  группе №22  провела  интеллектуальную игру \"Брейн ринг\" на английском языке. Игра состояла из 5 этапов, которые включали в себя историю Великобритании, традиции, достопримечательности Лондона, грамматику и культуру. По правилам игры \"Брейн ринг\", участники двух соревнующихся между собой команд, отвечали на вопросы преподавателя. Игра получилась интересная, поскольку использовались разнообразные виды работы на уроке. Оценивалось умение понимать, читать и говорить на английском языке. На последнем этапе \"Культура\" обучающиеся вместе с преподавателем исполнили красивую песню \"Yesterday\" английской группы Битлз. Самыми активными участниками игры признаны лидеры своих команд -Лыженкова Луиза и Ольшанская Виктория.",

            "Глубочайшие соболезнования родным и близким погибших! Это трагедия, невосполнимая утрата, сердце разрывается от такого… Кемерово, скорбим вместе с вами!"

    };

    private static final String[] NEWS_IMAGE_URLS = {
            "https://sun9-5.userapi.com/c831409/v831409310/bc8e5/NUXokyi7xY0.jpg",
            "https://pp.userapi.com/c846524/v846524000/b335/QqbAZ83bNjk.jpg",
            "https://pp.userapi.com/c846416/v846416100/83f6/KmyyaBoGdrU.jpg",
            "https://pp.userapi.com/c846016/v846016139/7a0b/OoRmnoSSftQ.jpg",
            "https://pp.userapi.com/c621513/v621513842/7a6d9/bQdT1GP8HDI.jpg"
    };

    @Override
    public Single<List<ArticleItem>> getNews() {
        return Single.just(generateRandomNews());
    }

    private List<ArticleItem> generateRandomNews(){
        ArrayList<ArticleItem> newsItems = new ArrayList<>();
        Random random = new Random();

        for (int i = 0; i < 5; i++){
            String newsItemTitle = NEWS_TITLES[random.nextInt(NEWS_TITLES.length)];
            String newsItemContent = NEWS_CONTENTS[random.nextInt(NEWS_CONTENTS.length)];
            String newsItemImageUrl = NEWS_IMAGE_URLS[random.nextInt(NEWS_IMAGE_URLS.length)];

            newsItems.add(new ArticleItem(newsItemTitle, newsItemImageUrl, newsItemContent));
        }

        return newsItems;
    }
}
